# ==============================
# НАСТРОЙКИ БОТА
# ==============================

BOT_TOKEN = "8631081728:AAHCSuxvSKVyzE1h6L8kUZfKvqM66UpjbTw"

# Твой Telegram ID
ADMIN_ID = 8141857093


# ==============================
# ОПЛАТА
# ==============================

# Реквизиты, которые увидит клиент
PAYMENT_DETAILS = """
💳 Реквизиты для оплаты

Карта:

2202 2092 2642 6665 Сбербанк

Получатель:

Aртем Русланович

Сумма:
 ₽

После оплаты нажмите кнопку «✅ Я оплатил»
и отправьте чек.
"""


# ==============================
# ТАРИФЫ
# ==============================

TARIFFS = {
    "vpn_7": {
        "name": "VPN на 7 дней",
        "price": 99,
        "days": 7
    },

    "vpn_30": {
        "name": "VPN на 30 дней",
        "price": 199,
        "days": 30
    },

    "vpn_90": {
        "name": "VPN на 90 дней",
        "price": 499,
        "days": 90
    }
}


# ==============================
# ТЕКСТЫ
# ==============================

BOT_NAME = "BRVPN SHOP"

WELCOME_TEXT = f"""
👋 Добро пожаловать в {BOT_NAME}!

🚀 Быстрый VPN
🔐 Личные ключи
⚡ Выдача после проверки оплаты

Выберите тариф ниже:
"""


# ==============================
# ФАЙЛ БАЗЫ ДАННЫХ
# ==============================

DATABASE = "vpn_bot.db"